package practiice;

public class start1 {
    public static void main(String[] args) {

// Напиши программу, которая выводит на экран надпись: «И восстали машинны из пепла ядерного огня"» 16 раз.

        for (int i = 1; i <= 16; i++) {

            System.out.println(i + " И восстали машинны из пепла ядерного огня!");
        }
/* Создать объект типа Cat 2 раза.
        Cat murzik = new Cat();
        Cat vaska = new Cat();
    }
 */
    }
}